<script setup>

</script>

<template>
    <div>
       <p>
        Санкт-Петербу́рг (в 1914—1924 годах — Петрогра́д, в 1924—1991 годах[b] — Ленингра́д, разг. — Пи́тер, Петербу́рг, СПб) — второй по численности населения город России[6]. Город федерального значения. Административный центр Северо-Западного федерального округа. Основан 16 (27) мая 1703 года царём Петром I. В 1714—1728 и 1732—1918 годах — столица Российского государства[c][7].

Назван в честь святого Петра[8] — небесного покровителя царя-основателя, но со временем стал всё больше ассоциироваться с именем самого Петра I. Город исторически и культурно связан с рождением Российской империи и вхождением России в современную историю в роли европейской великой державы[9]Перейти к разделу «#История».

Расположен на северо-западе страны на побережье Финского залива и в устье реки Невы. Граничит с Ленинградской областью, также имеет морские границы с Финляндией и ЭстониейПерейти к разделу «#Физико-географическая характеристика».

В Санкт-Петербурге находятся: конституционный суд РФ, геральдический совет при президенте РФ, полпредство Северо-Западного федерального округа, органы власти Ленинградской области[10], межпарламентская ассамблея СНГ. Также размещены: главное командование ВМФ РФ и штаб Ленинградского военного округа ВС РФ.

Был центром трёх революций: 1905—1907 годов, Февральской, Октябрьской[11]. В ходе Великой Отечественной войны в 1941—1944 годах 872 дня находился в блокаде, в результате которой погибло около миллиона человек. 1 мая 1945 года Ленинград был объявлен городом-героемПерейти к разделу «#История». В составе города федерального значения Санкт-Петербурга также находятся 3 города воинской славы: Кронштадт, Колпино и Ломоносов.

Население: 5 597 763[2] (2024) человек. Санкт-Петербург — самый северный в мире город с населением более миллиона человек. Также Санкт-Петербург является самым западным городом-миллионником России. Среди городов, полностью расположенных в Европе, он является третьим по населению (уступая лишь Москве и Лондону), а также первым по численности жителей городом, не являющимся столицей[12]. Инновационный сценарий «Стратегия развития Санкт‑Петербурга до 2030 года» предполагает, что к 2030 году население составит 5,9 миллиона человек[13]Перейти к разделу «#Население». Город — центр Санкт-Петербургской городской агломерации. Площадь города 1439[14] км², после расширения территории Москвы 1 июля 2012 года Санкт-Петербург является вторым по площади и населению городом страны.

Санкт-Петербург — важный экономический, научный и культурный центр России, крупный транспортный узелПерейти к разделу «#Транспорт». Исторический центр города и связанные с ним комплексы памятников входят в список объектов всемирного наследия ЮНЕСКО[15]; это один из самых важных в стране центров туризма. Среди наиболее значимых культурно-туристических объектов: Эрмитаж, Кунсткамера, Мариинский театр, Российская национальная библиотека, Русский музей, Петропавловская крепость, Исаакиевский собор[16], Невский проспектПерейти к разделу «#Культура и искусство». На сохранение объектов культурного наследия направлена, в том числе, программа сохранения и развития исторического центра Санкт-Петербурга. В 2019 году Санкт-Петербург посетили около 10,4 миллиона туристов[17]Перейти к разделу «#Экономика».
       </p>
    </div>
</template>

<style scoped>

</style>
